// Напишу программу, в которую пользователь вводит два целых числа
// и пролучает частное введенных чисел.
// Частное двух чисел - это деление на 2.
// Алгоритм:
// * Начало
// * Определить первое число; 
// * Определить второе число;
// * Вывести частное введенных чисел на экран;
// * Конец.
// -------------------------------------------------------------------------------------
// Первый вариант.
// int numberA = 12; // В ответе не будет показано остатка, т.к тип данных выбран "int".
// int numberB = 5; // int - тип данных, позволяющий хранить только целые числа.
// Console.WriteLine(numberA / numberB);
// ------------------------------------------------------------------------------------- 
// Второй вариант.
double numberA = 12; // В ответе будет показан остаток, т.к тип данных выбрать "double".
double numberB = 5; // double - это вещественный тип данных.
Console.WriteLine(numberA / numberB);

// Вещественные числа:
// Были натуральные числа. тобишь те, которые использовали при счете: 1, 2, 3 ... 
// а потом кому то понадобились и отрицательные числа включить туда и дробные, 
// и иррациональные. и он их назвал вещественными. тобишь вещественные числа - это те же натуральные, 
// но еще и включает отрицатаельные, иррациональные и дроби.