// Напишу программу, в которую пользователь вводит два целых числа
// и пролучает частное введенных чисел.
// Частное двух чисел - это деление на 2.
// Алгоритм:
// * Начало
// * Определить первое число; 
// * Определить второе число;
// * Вывести частное введенных чисел на экран;
// * Конец.
// -------------------------------------------------------------------------------------
// Первый вариант.
// int numberA = 12; // В ответе не будет показано остатка, т.к тип данных выбрать "int".
// int numberB = 5;
// Console.WriteLine(numberA / numberB);
// ------------------------------------------------------------------------------------- 
// Второй вариант.
double numberA = 12; // В ответе будет показан остаток, т.к тип данных выбрать "double".
double numberB = 5;
Console.WriteLine(numberA / numberB);